yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/uart/inc/rtl_uart.h
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL_UART_H
#define RTL_UART_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "utils/rtl_utils.h"
#if defined (CONFIG_SOC_SERIES_RTL87X2G)
#include "uart/src/rtl87x2g/rtl_uart_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3E)
#include "uart/src/rtl87x3e/rtl_uart_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3D)
#include "uart/src/rtl87x3d/rtl_uart_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL8762J)
#include "uart/src/rtl87x2j/rtl_uart_def.h"
#endif

/** \defgroup UART        UART
  * \brief
  * \{
  */
/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup UART_Exported_Constants UART Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    UART_FIFO_Size UART FIFO Size
 * \{
 * \ingroup     UART_Exported_Constants
 */
#define UART_TX_FIFO_SIZE           16 //!< UART TX FIFO size is 16.
#define UART_RX_FIFO_SIZE           32 //!< UART RX FIFO size is 32.

/** End of UART_FIFO_Size
  * \}
  */

/**
 * \defgroup    UART_Baudrate UART Baudrate
 * \{
 * \ingroup     UART_Exported_Constants
 */
typedef enum
{
    UART_BAUD_RATE_1200,      //!< UART bandrate is 1200Hz.
    UART_BAUD_RATE_4800,      //!< UART bandrate is 4800Hz.
    UART_BAUD_RATE_7200,      //!< UART bandrate is 7200Hz.
    UART_BAUD_RATE_9600,      //!< UART bandrate is 9600Hz.
    UART_BAUD_RATE_14400,     //!< UART bandrate is 14400Hz.
    UART_BAUD_RATE_19200,     //!< UART bandrate is 19200Hz.
    UART_BAUD_RATE_28800,     //!< UART bandrate is 28800Hz.
    UART_BAUD_RATE_38400,     //!< UART bandrate is 38400Hz.
    UART_BAUD_RATE_57600,     //!< UART bandrate is 57600Hz.
    UART_BAUD_RATE_76800,     //!< UART bandrate is 76800Hz.
    UART_BAUD_RATE_115200,    //!< UART bandrate is 115200Hz.
    UART_BAUD_RATE_128000,    //!< UART bandrate is 128000Hz.
    UART_BAUD_RATE_153600,    //!< UART bandrate is 153600Hz.
    UART_BAUD_RATE_230400,    //!< UART bandrate is 230400Hz.
    UART_BAUD_RATE_460800,    //!< UART bandrate is 460800Hz.
    UART_BAUD_RATE_500000,    //!< UART bandrate is 500000Hz.
    UART_BAUD_RATE_921600,    //!< UART bandrate is 921600Hz.
    UART_BAUD_RATE_1000000,   //!< UART bandrate is 1000000Hz.
    UART_BAUD_RATE_1382400,   //!< UART bandrate is 1382400Hz.
    UART_BAUD_RATE_1444400,   //!< UART bandrate is 1444400Hz.
    UART_BAUD_RATE_1500000,   //!< UART bandrate is 1500000Hz.
    UART_BAUD_RATE_1843200,   //!< UART bandrate is 1843200Hz.
    UART_BAUD_RATE_2000000,   //!< UART bandrate is 2000000Hz.
    UART_BAUD_RATE_3000000,   //!< UART bandrate is 3000000Hz.
    UART_BAUD_RATE_4000000,   //!< UART bandrate is 4000000Hz.
} UARTBaudrate_TypeDef;

/** End of UART_Baudrate
  * \}
  */

/**
 * \defgroup    UART_Parity UART Parity
 * \{
 * \ingroup     UART_Exported_Constants
 */
typedef enum
{
    UART_PARITY_NO_PARTY = 0x0,      //!< UART has no parity.
    UART_PARITY_ODD = 0x1,           //!< UART parity bit is set to odd.
    UART_PARITY_EVEN = 0x3,          //!< UART parity bit is set to even.
} UARTParity_TypeDef;

#define IS_UART_PARITY(PARITY) (((PARITY) == UART_PARITY_NO_PARTY) || \
                                ((PARITY) == UART_PARITY_ODD) || \
                                ((PARITY) == UART_PARITY_EVEN)) //!< Check if the input parameter is valid.

/** End of UART_Parity
  * \}
  */

/**
 * \defgroup    UART_Stop_Bits UART Stop Bits
 * \{
 * \ingroup     UART_Exported_Constants
 */
typedef enum
{
    UART_STOP_BITS_1 = 0x0,      //!< UART is configured with 1 stop bit.
    UART_STOP_BITS_2 = 0x1,      //!< UART is configured with 2 stop bit.
} UARTStopBits_TypeDef;

#define IS_UART_STOPBITS(STOP) (((STOP) == UART_STOP_BITS_1) || \
                                ((STOP) == UART_STOP_BITS_2)) //!< Check if the input parameter is valid.

/** End of UART_Stop_Bits
  * \}
  */

/**
 * \defgroup    UART_Word_Length UART Word Length
 * \{
 * \ingroup     UART_Exported_Constants
 */
typedef enum
{
    UART_WORD_LENGTH_7BIT = 0x0,     //!< UART word length is set to 7 Data Bits.
    UART_WORD_LENGTH_8BIT = 0x1,     //!< UART word length is set to 8 Data Bits.
} UARTWordLen_TypeDef;

#define IS_UART_WORD_LENGTH(LEN) ((((LEN)) == UART_WORD_LENGTH_7BIT) || \
                                  (((LEN)) == UART_WORD_LENGTH_8BIT)) //!< Check if the input parameter is valid.

/** End of UART_Word_Length
  * \}
  */

/**
 * \defgroup    UART_Hardware_Flow_Control UART Hardware Flow Control
 * \{
 * \ingroup     UART_Exported_Constants
 */
typedef enum
{
    UART_HW_FLOW_CTRL_DISABLE = 0x0,     //!< Disable UART hardware flow control.
    UART_HW_FLOW_CTRL_ENABLE = 0x1,      //!< Enable UART hardware flow control.
} UARTHwFlowCtrl_TypeDef;

#define IS_UART_AUTO_FLOW_CTRL(CTRL) (((CTRL) == UART_HW_FLOW_CTRL_ENABLE) || \
                                      ((CTRL) == UART_HW_FLOW_CTRL_DISABLE)) //!< Check if the input parameter is valid.

/** End of UART_Hardware_Flow_Control
  * \}
  */

/**
 * \defgroup    UART_DMA UART DMA
 * \{
 * \ingroup     UART_Exported_Constants
 */
typedef enum
{
    UART_DMA_DISABLE = 0x0,     //!< Disable UART DMA function.
    UART_DMA_ENABLE  = 0x1,     //!< Enable UART DMA function.
} UARTDma_TypeDef;

#define IS_UART_DMA_CFG(CFG) (((CFG) == UART_DMA_ENABLE) || \
                              ((CFG) == UART_DMA_DISABLE)) //!< Check if the input parameter is valid.

/** End of UART_DMA
  * \}
  */

/**
 * \defgroup    UART_Rx_Idle_Time UART Rx Idle Time
 * \{
 * \ingroup     UART_Exported_Constants
 */
typedef enum
{
    UART_RX_IDLE_1BYTE = 0x0,        //!< UART Rx idle time is set to 1 byte.
    UART_RX_IDLE_2BYTE = 0x1,        //!< UART Rx idle time is set to 2 bytes.
    UART_RX_IDLE_4BYTE = 0x2,        //!< UART Rx idle time is set to 4 bytes.
    UART_RX_IDLE_8BYTE = 0x3,        //!< UART Rx idle time is set to 8 bytes.
    UART_RX_IDLE_16BYTE = 0x4,       //!< UART Rx idle time is set to 16 bytes.
    UART_RX_IDLE_32BYTE = 0x5,       //!< UART Rx idle time is set to 32 bytes.
    UART_RX_IDLE_64BYTE = 0x6,       //!< UART Rx idle time is set to 64 bytes.
    UART_RX_IDLE_128BYTE = 0x7,      //!< UART Rx idle time is set to 128 bytes.
    UART_RX_IDLE_256BYTE = 0x8,      //!< UART Rx idle time is set to 256 bytes.
    UART_RX_IDLE_512BYTE = 0x9,      //!< UART Rx idle time is set to 512 bytes.
    UART_RX_IDLE_1024BYTE = 0xA,     //!< UART Rx idle time is set to 1024 bytes.
    UART_RX_IDLE_2048BYTE = 0xB,     //!< UART Rx idle time is set to 2048 bytes.
    UART_RX_IDLE_4096BYTE = 0xC,     //!< UART Rx idle time is set to 4096 bytes.
    UART_RX_IDLE_8192BYTE = 0xD,     //!< UART Rx idle time is set to 8192 bytes.
    UART_RX_IDLE_16384BYTE = 0xE,    //!< UART Rx idle time is set to 16384 bytes.
    UART_RX_IDLE_32768BYTE = 0xF,    //!< UART Rx idle time is set to 32768 bytes.
} UARTTimeout_TypeDef;

