yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/uart/inc/rtl_uart.h
#define IS_UART_IDLE_TIME(TIME) ((TIME) <= 0x0F) //!< Check if the input parameter is valid.

/** End of UART_Rx_Idle_Time
  * \}
  */

/**
 * \defgroup    UART_Rx_FIFO_Trigger_Level UART Rx FIFO Trigger Level
 * \{
 * \ingroup     UART_Exported_Constants
 */
typedef enum
{
    UART_RX_FIFO_TRIGGER_LEVEL_1BYTE = 0x1,    //!< UART Rx FIFO trigger level is set to 1 byte.
    UART_RX_FIFO_TRIGGER_LEVEL_4BYTE = 0x4,    //!< UART Rx FIFO trigger level is set to 4 bytes.
    UART_RX_FIFO_TRIGGER_LEVEL_8BYTE = 0x8,    //!< UART Rx FIFO trigger level is set to 8 bytes.
    UART_RX_FIFO_TRIGGER_LEVEL_14BYTE = 0xE,   //!< UART Rx FIFO trigger level is set to 14 bytes.
} UARTRxFifoTriggerLevel_TypeDef;

#define IS_UART_RX_FIFO_TRIGGER_LEVEL(BYTES) ((BYTES) <= 29) //!< Check if the input parameter is valid.

/** End of UART_Rx_FIFO_Trigger_Level
  * \}
  */

#if (UART_SUPPORT_RAP_FUNCTION == 1)
/**
 * \defgroup    UART_Qactive_Force UART Qactive Force
 * \{
 * \ingroup     UART_Exported_Constants
 */
typedef enum
{
    UART_QACTIVE_SCLK_FORCE = 0x0,
    UART_QACTIVE_PCLK_FORCE = 0x1,
    UART_QACTIVE_PCLK_ICG   = 0x2,
} UARTQactiveForce_TypeDef;

/** End of UART_Qactive_Force
  * \}
  */

#endif

/**
 * \defgroup    UART_Interrupts UART Interrupts
 * \{
 * \ingroup     UART_Exported_Constants
 */
#define UART_INT_RD_AVA                 BIT0     //!< UART Rx data available interrupt
#define UART_INT_TX_FIFO_EMPTY          BIT1     //!< UART Tx FIFO empty interrupt
#define UART_INT_RX_LINE_STS            BIT2     //!< UART Rx line status error interrupt
//#define UART_INT_MODEM_STS              BIT3
#if UART_SUPPORT_TX_DONE
#define UART_INT_TX_DONE                BIT4     //!< UART Tx done interrupt
#endif
#if UART_SUPPORT_TX_THD
#define UART_INT_TX_THD                 BIT5     //!< UART Tx threshold interrupt
#endif
//#define UART_INT_RX_BREAK               BIT6
#define UART_INT_RX_IDLE                BIT7     //!< UART Rx idle interrupt

#define IS_UART_INT(INT) ((((INT) & 0xFFFFFF80) == 0x00) && ((INT) != 0x00)) //!< Check if the input parameter is valid.

#define IS_UART_GET_INT(INT) ((INT) & (UART_INT_RD_AVA | \
                                       UART_INT_TX_FIFO_EMPTY | \
                                       UART_INT_RX_LINE_STS | \
                                       UART_INT_MODEM_STS | \
                                       UART_INT_TX_DONE | \
                                       UART_INT_TX_THD | \
                                       UART_INT_RX_BREAK | \
                                       UART_INT_RX_IDLE)) //!< Check if the input parameter is valid.

/** End of UART_Interrupts
  * \}
  */

/**
 * \defgroup    UART_Interrupt_Identifier UART Interrupt Identifier
 * \{
 * \ingroup     UART_Exported_Constants
 */
#define UART_INT_PENDING                ((uint16_t)(0x01 << 0))     //!< UART interrupt is pending.
#define UART_INT_ID_LINE_STATUS         ((uint16_t)(0x03 << 1))     //!< UART Rx line status interrupt ID.
#define UART_INT_ID_RX_LEVEL_REACH      ((uint16_t)(0x02 << 1))     //!< UART Rx data available or trigger level reached interrupt ID.
#define UART_INT_ID_RX_DATA_TIMEOUT     ((uint16_t)(0x06 << 1))     //!< UART Rx FIFO data timeout interrupt ID.
#define UART_INT_ID_TX_FIFO_EMPTY       ((uint16_t)(0x01 << 1))     //!< UART Tx FIFO empty interrupt ID.
//#define UART_INT_ID_MODEM_STATUS        ((uint16_t)(0x00 << 1))

#define IS_UART_INT_ID(ID) (((ID) == UART_INT_ID_LINE_STATUS) || \
                            ((ID) == UART_INT_ID_RX_LEVEL_REACH) || \
                            ((ID) == UART_INT_ID_RX_DATA_TIMEOUT) || \
                            ((ID) == UART_INT_ID_TX_FIFO_EMPTY) || \
                            ((ID) == UART_INT_ID_MODEM_STATUS)) //!< Check if the input parameter is valid.

/** End of UART_Interrupt_Identifier
  * \}
  */

/**
 * \defgroup    UART_Flag UART Flag
 * \{
 * \ingroup     UART_Exported_Constants
 */
#define UART_FLAG_RX_DATA_AVA           BIT0     //!< UART Rx data available interrupt flag.
#define UART_FLAG_RX_OVERRUN            BIT1     //!< UART Rx FIFO overrun interrupt flag.
#define UART_FLAG_RX_PARITY_ERR         BIT2     //!< UART Rx parity error interrupt flag.
#define UART_FLAG_RX_FRAME_ERR          BIT3     //!< UART Rx frame error interrupt flag.
#define UART_FLAG_RX_BREAK_ERR          BIT4     //!< UART Rx break error interrupt flag.
#define UART_FLAG_TX_FIFO_EMPTY         BIT5     //!< UART Tx holding register or Tx FIFO empty interrupt flag.
#define UART_FLAG_TX_EMPTY              BIT6     //!< UART Tx FIFO and Tx shift register are both empty interrupt flag.
#define UART_FLAG_RX_FIFO_ERR           BIT7     //!< UART Rx FIFO error interrupt flag.
//#define UART_FLAG_RX_BREAK              BIT8
#define UART_FLAG_RX_IDLE               BIT9     //!< UART Rx idle interrupt flag.
#if UART_SUPPORT_TX_DONE
#define UART_FLAG_TX_DONE               BIT10    //!< UART Tx done interrupt flag.
#endif
#if UART_SUPPORT_TX_THD
#define UART_FLAG_TX_THD                BIT11    //!< UART Tx threshold interrupt flag.
#endif

#define IS_UART_GET_FLAG(FLAG) (((FLAG) == UART_FLAG_RX_DATA_RDY) || \
                                ((FLAG) == UART_FLAG_RX_OVERRUN) || \
                                ((FLAG) == UART_FLAG_PARTY_ERR) || \
                                ((FLAG) == UART_FLAG_FRAME_ERR) || \
                                ((FLAG) == UART_FLAG_BREAK_ERR) || \
                                ((FLAG) == UART_FLAG_THR_EMPTY) || \
                                ((FLAG) == UART_FLAG_THR_TSR_EMPTY) || \
                                ((FLAG) == UART_FLAG_RX_FIFO_ERR) || \
                                ((FLAG) == UART_FLAG_RX_IDLE)) //!< Check if the input parameter is valid.

/** End of UART_Flag
  * \}
  */

/**
 * \defgroup    UART_Interrupts_Mask UART Interrupts Mask
 * \{
 * \ingroup     UART_Exported_Constants
 */
#define UART_INT_MASK_RD_AVA            BIT0 //!< Mask received data avaliable interrupt(RX fifo trigger level or timeout).
#define UART_INT_MASK_TX_FIFO_EMPTY     BIT1 //!< Mask transmitter FIFO empty interrupt.
#define UART_INT_MASK_RX_LINE_STS       BIT2 //!< Mask receiver line status interrupt.
//#define UART_INT_MASK_MODEM_STS         BIT3
//#define UART_INT_MASK_RX_BREAK          BIT4
#define UART_INT_MASK_RX_IDLE           BIT5 //!< Mask RX idle timeout interrupt.
#if UART_SUPPORT_TX_DONE
#define UART_INT_MASK_TX_DONE           BIT6 //!< Mask TX done(TX shift register empty and TX FIFO empty) interrupt.
#endif
#if UART_SUPPORT_TX_THD
#define UART_INT_MASK_TX_THD            BIT7 //!< Mask TX FIFO threshold interrupt.
#endif

#define IS_UART_INT_MASK(INT) ((INT) & (UART_INT_MASK_RD_AVA | \
                                        UART_INT_MASK_TX_FIFO_EMPTY | \
                                        UART_INT_MASK_RX_LINE_STS | \
                                        UART_INT_MASK_MODEM_STS | \
                                        UART_INT_MASK_RX_BREAK | \
                                        UART_INT_MASK_RX_IDLE | \
                                        UART_INT_MASK_TX_DONE | \
                                        UART_INT_MASK_TX_THD)) //!< Check if the input parameter is valid.

