yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/uart/inc/rtl_uart.h
/** End of UART_Interrupts_Mask
  * \}
  */


/** End of UART_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         Types
 *============================================================================*/
/** \defgroup UART_Exported_Types UART Exported Types
  * \brief
  * \{
  */

/**
 * \brief       UART initialize parameters
 *
 * \ingroup     UART_Exported_Types
 */
typedef struct
{
    uint16_t UART_OvsrAdj;              /*!< Specify the baudrate setting of ovsr_adj.
                                             Please refer to UART_BaudRate_Table in \ref UART_SetBaudRate. */

    uint16_t UART_Div;                  /*!< Specify the baud rate setting of div.
                                             Please refer to UART_BaudRate_Table in \ref UART_SetBaudRate. */

    uint16_t UART_Ovsr;                 /*!< Specify the baud rate setting of ovsr.
                                             Please refer to UART_BaudRate_Table in \ref UART_SetBaudRate. */

    UARTWordLen_TypeDef UART_WordLen;   /*!< Specify the UART word length.
                                             This parameter can be a value of \ref UART_Word_Length. */

    UARTStopBits_TypeDef UART_StopBits; /*!< Specify the UART stop bit.
                                             This parameter can be a value of \ref UART_Stop_Bits. */

    UARTParity_TypeDef UART_Parity;     /*!< Specify the parity.
                                             This parameter can be a value of \ref UART_Parity. */

    uint8_t UART_TxThdLevel;            /*!< Specify the Tx threshold level.
                                             This parameter must range from 1 to 29.*/

    uint8_t UART_RxThdLevel;            /*!< Specify the Rx threshold level.
                                             This parameter must range from 1 to 29.*/

    UARTTimeout_TypeDef UART_IdleTime;  /*!< Specify the idle time.
                                             This parameter can be a value of \ref UART_Rx_Idle_Time. */

    uint8_t UART_HardwareFlowControl;   /*!< Enable or Disable hardware flow control.
                                             This parameter can be a value of DISABLE and ENABLE. */

    uint8_t UART_DmaEn;                 /*!< Enable or Disable dma mode.
                                             This parameter can be a value of DISABLE and ENABLE. */

    uint8_t UART_TxDmaEn;               /*!< Enable or Disable Tx dma mode.
                                             This parameter can be a value of DISABLE and ENABLE. */

    uint8_t UART_RxDmaEn;               /*!< Enable or Disable Rx dma mode.
                                             This parameter can be a value of DISABLE and ENABLE. */

    uint8_t UART_TxWaterLevel;          /*!< Specify the DMA tx water level.
                                             This parameter must range from 1 to 16. */

    uint8_t UART_RxWaterLevel;          /*!< Specify the DMA rx water level.
                                             This parameter must range from 1 to 31. */
} UART_InitTypeDef;

/** End of UART_Exported_Types
  * \}
  */

/*============================================================================*
 *                         Functions
 *============================================================================*/
/** \defgroup UART_Exported_Functions UART Exported Functions
  * \brief
  * \{
  */

/**
 * \brief   Deinitialize the selected UART peripheral registers to their default reset values(turn off UART clock).
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_uart_init(void)
 * {
 *    UART_DeInit(UART0);
 * }
 * \endcode
 */
void UART_DeInit(UART_TypeDef *UARTx);

/**
 * \brief   Initialize the selected UART peripheral according to the specified
 *          parameters in  UART_InitStruct.
 *
 * \param[in] UARTx            Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] UART_InitStruct  Pointer to a UART_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_uart_init(void)
 * {
 *     UART_DeInit(UART0);
 *
 *     RCC_PeriphClockCmd(APBPeriph_UART0, APBPeriph_UART0_CLOCK, ENABLE);
 *
 *     UART_InitTypeDef UART_InitStruct;
 *     UART_StructInit(&UART_InitStruct);
 *     UART_InitStruct.UART_Div         = 20;
 *     UART_InitStruct.UART_Ovsr        = 12;
 *     UART_InitStruct.UART_OvsrAdj     = 0x252;
 *     UART_InitStruct.UART_RxThdLevel  = 16;
 *    //Add other initialization parameters that need to be configured here.
 *     UART_Init(UART0, &UART_InitStruct);
 * }
 * \endcode
 */
void UART_Init(UART_TypeDef *UARTx, UART_InitTypeDef *UART_InitStruct);

/**
 * \brief   Fill each UART_InitStruct member with its default value.
 *
 * \note   The default settings for the UART_InitStruct member are shown in the following table:
 *         | UART_InitStruct member     | Default value                  |
 *         |:--------------------------:|:------------------------------:|
 *         | UART_Div                   | 20                             |
 *         | UART_Ovsr                  | 12                             |
 *         | UART_OvsrAdj               | 0x252                          |
 *         | UART_Parity                | \ref UART_PARITY_NO_PARTY      |
 *         | UART_StopBits              | \ref UART_STOP_BITS_1          |
 *         | UART_WordLen               | \ref UART_WORD_LENGTH_8BIT     |
 *         | UART_TxThdLevel            | 16                             |
 *         | UART_RxThdLevel            | 16                             |
 *         | UART_IdleTime              | \ref UART_RX_IDLE_2BYTE        |
 *         | UART_HardwareFlowControl   | \ref UART_HW_FLOW_CTRL_DISABLE |
 *         | UART_DmaEn                 | \ref UART_DMA_DISABLE          |
 *         | UART_TxDmaEn               | DISABLE                        |
 *         | UART_RxDmaEn               | DISABLE                        |
 *         | UART_TxWaterLevel          | 15                             |
 *         | UART_RxWaterLevel          | 1                              |
 *
 * \param[in] UART_InitStruct  Pointer to an UART_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_uart_init(void)
 * {
 *     UART_DeInit(UART0);
 *
 *     RCC_PeriphClockCmd(APBPeriph_UART0, APBPeriph_UART0_CLOCK, ENABLE);
 *
 *     UART_InitTypeDef UART_InitStruct;
 *     UART_StructInit(&UART_InitStruct);
 *     UART_InitStruct.UART_Div         = 20;
 *     UART_InitStruct.UART_Ovsr        = 12;
 *     UART_InitStruct.UART_OvsrAdj     = 0x252;
 *     UART_InitStruct.UART_RxThdLevel  = 16;
 *     //Add other initialization parameters that need to be configured here.
 *     UART_Init(UART0, &UART_InitStruct);
 * }
 * \endcode
 */
void UART_StructInit(UART_InitTypeDef *UART_InitStruct);

/**
 * \brief   Mask or unmask the specified UART interrupt source.
 *
 * \param[in] UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] UART_INT  Specify the UART interrupt source that to be mask or unmask.
 *                      This parameter can be one of the following values, refer to \ref UART_Interrupts_Mask.
 *                      \arg UART_INT_MASK_RD_AVA: Mask INTCR(erbi).
 *                      \arg UART_INT_MASK_FIFO_EMPTY: Mask INTCR(etbei).
 *                      \arg UART_INT_MASK_LINE_STS: Mask INTCR(elsi).
 *                      \arg UART_INT_MASK_MODEM_STS: Mask INTCR(edssi).
 *                      \arg UART_INT_MASK_RX_BREAK: Mask rx break interrupt.
 *                      \arg UART_INT_MASK_RX_IDLE: Mask rx break interrupt.
 *                      \arg UART_INT_MASK_TX_DONE: Mask the interrupt tx done interrupt.
 *                      \arg UART_INT_MASK_TX_THD: Mask tx fifo threshold interrupt.
 * \param[in] NewState  New state of the specified UART interrupt source.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Mask the specified UART interrupt source.
 *                      - DISABLE: Unmask the specified UART interrupt source.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_uart_init(void)
 * {
 *     UART_DeInit(UART0);
 *
 *     RCC_PeriphClockCmd(APBPeriph_UART0, APBPeriph_UART0_CLOCK, ENABLE);
 *
 *     UART_InitTypeDef UART_InitStruct;
 *     UART_StructInit(&UART_InitStruct);
 *     UART_InitStruct.UART_Div         = 20;
 *     UART_InitStruct.UART_Ovsr        = 12;
 *     UART_InitStruct.UART_OvsrAdj     = 0x252;
 *     UART_InitStruct.UART_RxThdLevel  = 16;
 *     //Add other initialization parameters that need to be configured here.
 *     UART_Init(UART0, &UART_InitStruct);
 *
 *     UART_MaskINTConfig(UART0, UART_INT_MASK_RD_AVA, ENABLE);
 *     UART_INTConfig(UART0, UART_INT_RD_AVA, ENABLE);
 *     UART_MaskINTConfig(UART0, UART_INT_MASK_RD_AVA, DISABLE);
 * }
 * \endcode
 */
void UART_MaskINTConfig(UART_TypeDef *UARTx, uint32_t UART_INT_MASK,
                        FunctionalState NewState);
/**
 * \brief   Enable or disable the specified UART interrupts.
 *
 * \param[in] UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] UART_IT   Specify the UART interrupt source that to be enabled or disabled.
 *                      This parameter can be any combination of the following values, refer to \ref UART_Interrupts.
 *                      \arg UART_INT_RD_AVA: Rx data avaliable interrupt source.
 *                      \arg UART_INT_TX_FIFO_EMPTY: Tx FIFO empty interrupt source.
 *                      \arg UART_INT_RX_LINE_STS: Rx line status interrupt source.
 *                      \arg UART_INT_MODEM_STS: Modem status interrupt source.
 *                      \arg UART_INT_TX_DONE: Tx done interrupt source.
 *                      \arg UART_INT_TX_THD: Tx threshold(FIFO data length <= thredhold) interrupt source.
 *                      \arg UART_INT_RX_BREAK: Rx break signal interrupt source.
 *                      \arg UART_INT_RX_IDLE: Rx bus ilde interrupt source.
 * \param[in] NewState  New state of the specified UART interrupt source.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the specified UART interrupt.
 *                      - DISABLE: Disable the specified UART interrupt.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_uart_init(void)
 * {
 *     UART_DeInit(UART0);
 *
 *     RCC_PeriphClockCmd(APBPeriph_UART0, APBPeriph_UART0_CLOCK, ENABLE);
 *
 *     UART_InitTypeDef UART_InitStruct;
 *     UART_StructInit(&UART_InitStruct);
 *     UART_InitStruct.UART_Div         = 20;
 *     UART_InitStruct.UART_Ovsr        = 12;
 *     UART_InitStruct.UART_OvsrAdj     = 0x252;
 *     UART_InitStruct.UART_RxThdLevel  = 16;
 *     //Add other initialization parameters that need to be configured here.
 *     UART_Init(UART0, &UART_InitStruct);
 *
 *     UART_INTConfig(UART0, UART_INT_RD_AVA, ENABLE);
 * }
 * \endcode
 */
void UART_INTConfig(UART_TypeDef *UARTx, uint32_t UART_IT, FunctionalState NewState);

/**
 * \brief   Send data.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] inBuf  Buffer of data to be sent.
 * \param[in] count  Length of data to be sent.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data[] = "UART demo";
 *     UART_SendData(UART0, data, sizeof(data));
 * }
 * \endcode
 */
void UART_SendData(UART_TypeDef *UARTx, const uint8_t *inBuf, uint16_t Count);

#if UART_SUPPORT_HALF_WORD
/**
 * \brief   Send half word data.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] inBuf  Buffer of data to be sent.
 * \param[in] count  Length of data to be sent.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data[] = "UART demo";
 *     UART_SendHalfWordData(UART0, data, sizeof(data));
 * }
 * \endcode
 */
void UART_SendHalfWordData(UART_TypeDef *UARTx, const uint16_t *inBuf, uint16_t Count);
#endif

