yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/uart/inc/rtl_uart.h
#if UART_SUPPORT_TXDATA_API
/**
 * \brief   Tx data.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] inBuf  Buffer of data to be sent.
 * \param[in] count  Length of data to be sent.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data[] = "UART demo";
 *     UART_TxData(UART0, data, sizeof(data));
 * }
 * \endcode
 */
void UART_TxData(UART_TypeDef *UARTx, const uint8_t *inBuf, uint16_t count);
#endif

/**
 * \brief   Receive data from RX FIFO.
 *
 * \param[in]  UARTx   Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[out] outBuf  Buffer to store data which read from RX FIFO.
 * \param[in]  count   Length of data to read.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data[32] = {10};
 *     UART_ReceiveData(UART0, data, 10);
 * }
 * \endcode
 */
void UART_ReceiveData(UART_TypeDef *UARTx, uint8_t *outBuf, uint16_t count);

#if UART_SUPPORT_HALF_WORD
/**
 * \brief   Receive half word data from RX FIFO.
 *
 * \param[in]  UARTx   Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[out] outBuf  Buffer to store data which read from RX FIFO.
 * \param[in]  count   Length of data to read.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data[32] = {10};
 *     UART_ReceiveData(UART0, data, 10);
 * }
 * \endcode
 */
void UART_ReceiveHalfWordData(UART_TypeDef *UARTx, uint16_t *outBuf, uint16_t count);
#endif

/**
 * \brief   Set UART communication baudrate.
 *
 * \param[in]  UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in]  div       Parameter of the selected UART baudrate.
 * \param[in]  ovsr      Parameter of the selected UART baudrate.
 * \param[in]  ovsr_adj  Parameter of the selected UART baudrate.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * UART BaudRate Table: Baud rate set value for different data length (clock source 40MHz only)
 *  9 bits data length: start bit + 7 data bit + stop bit
 * 10 bits data length: start bit + 8 data bit + stop bit
 * 11 bits data length: start bit + 8 data bit + parity bit + stop bit
 * 12 bits data length: start bit + 8 data bit + parity bit + stop bit+ 2nd Stop bit
    baudrate |       9 bits data length      |       10 bits data length     |      11 bits data length      |      12 bits data length      |
             |  ovsr  |  ovsr_adj  |  div    |  ovsr  |  ovsr_adj  |  div    |  ovsr  |  ovsr_adj  |  div    |  ovsr  |  ovsr_adj  |  div    |
   --------------------------------------------------------------------------------------------------------------------------------------------
   1200      |   0x5      0x16D      0xC35   |   0x9      0x112      0x91B   |   0x9      0x70       0x91B   |   0x9      0x71       0x91B   |
   4800      |   0x0      0x0        0x682   |   0x0      0x0        0x682   |   0xB      0x6DD      0x1F3   |   0xB      0x6D5      0x1F3   |
   7200      |   0x0      0x0        0x457   |   0x0      0x0        0x457   |   0xC      0x84       0x143   |   0xC      0x84       0x143   |
   9600      |   0x0      0x0        0x341   |   0x0      0x0        0x341   |   0x7      0x7EF      0x143   |   0x7      0x7EF      0x143   |
   14400     |   0x6      0x10       0xFA    |   0x9      0x10       0xC5    |   0x9      0x10       0xC5    |   0x9      0x10       0xC5    |
   19200     |   0x2      0x3        0x120   |   0x1      0x3        0x150   |   0x8      0x77B      0x97    |   0x8      0x77B      0x97    |
   28800     |   0x2      0x3        0xC0    |   0x1      0x3        0xE0    |   0x6      0x84       0x7C    |   0x6      0x84       0x7C    |
   38400     |   0x2      0x3        0x90    |   0x1      0x3        0xA8    |   0xE      0x122      0x36    |   0xE      0x122      0x36    |
   57600     |   0x2      0x3        0x60    |   0x1      0x3        0x70    |   0x6      0x84       0x3E    |   0x6      0x84       0x3E    |
   76800     |   0x2      0x3        0x48    |   0x1      0x3        0x54    |   0xE      0x122      0x1B    |   0xE      0x122      0x1B    |
   115200    |   0x2      0x3        0x30    |   0x1      0x3        0x38    |   0x6      0x84       0x1F    |   0x6      0x84       0x1F    |
   230400    |   0x2      0x3        0x18    |   0x1      0x3        0x1C    |   0xE      0x122      0x9     |   0xE      0x122      0x9     |
   460800    |   0x2      0x3        0xC     |   0x1      0x3        0xE     |   0x7      0x14A      0x7     |   0x7      0x15A      0x7     |
   500000    |   0x5      0x0        0x8     |   0x5      0x0        0x8     |   0x5      0x0        0x8     |   0x5      0x0        0x8     |
   921600    |   0x2      0x3        0x6     |   0x1      0x3        0x7     |   0x9      0x2AA      0x3     |   0x9      0x2AB      0x3     |
   1000000   |   0x0      0x0        0x8     |   0x0      0x0        0x8     |   0x5      0x0        0x4     |   0x5      0x0        0x4     |
   1382400   |   0x9      0xAA       0x2     |   0x9      0x2AA      0x2     |   0x9      0x2AA      0x2     |   0x9      0x2AB      0x2     |
   1444400   |   0x8      0x1F7      0x2     |   0x8      0x3F7      0x2     |   0x8      0x3F7      0x2     |   0x8      0x3FF      0x2     |
   1500000   |   0x8      0x92       0x2     |   0x8      0x92       0x2     |   0x8      0x492      0x2     |   0x8      0x490      0x2     |
   1843200   |   0x5      0x1F7      0x2     |   0x5      0x3F7      0x2     |   0x5      0x3F7      0x2     |   0x5      0x3FF      0x2     |
   2000000   |   0x0      0x0        0x4     |   0x0      0x0        0x4     |   0x5      0x0        0x2     |   0x5      0x0        0x2     |
   3000000   |   0x8      0x92       0x1     |   0x8      0x92       0x1     |   0x8      0x492      0x1     |   0x8      0x490      0x1     |
   4000000   |   0x5      0x0        0x1     |   0x5      0x0        0x1     |   0x5      0x0        0x1     |   0x5      0x0        0x1     |
   ---------------------------------------------------------------------------------------------------------------------------------------------
 *
 * void uart_demo(void)
 * {
 *     uint16_t div = 20;
 *     uint16_t ovsr = 12;
 *     uint16_t ovsr_adj = 0x252;
 *     UART_SetBaudRate(UART0, div, ovsr, ovsr_adj);
 * }
 *
 * \endcode
 */
void UART_SetBaudRate(UART_TypeDef *UARTx, uint16_t div, uint16_t ovsr, uint16_t ovsr_adj);

/**
 * \brief   Set UART communication parameters.
 *
 * \param[in] UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] wordLen   Data width of the selected UART peripheral.
 *                      This parameter can be one of the following values:
 *                      \arg UART_WORD_LENGTH_7BIT: 7-bit data length.
 *                      \arg UART_WORD_LENGTH_8BIT: 8-bit data length.
 * \param[in] parity    Parity of the selected UART peripheral.
 *                      This parameter can be one of the following values:
 *                      \arg UART_STOP_BITS_1: 1-bit stop bit.
 *                      \arg UART_STOP_BITS_2: 2-bit stop bit.
 * \param[in] stopBits  Stop bit of the selected UART peripheral.
 *                      This parameter can be one of the following values:
 *                      - UART_PARITY_NO_PARTY: No parity.
 *                      - UART_PARITY_ODD: Odd parity.
 *                      - UART_PARITY_EVEN: Even parity.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint16_t word_len = UART_WORD_LENGTH_8BIT;
 *     uint16_t parity = UART_PARITY_NO_PARTY;
 *     uint16_t stop_bits = UART_STOP_BITS_1;
 *     UART_SetParams(UART0, wordLen, parity, stopBits);
 * }
 * \endcode
 */
void UART_SetParams(UART_TypeDef *UARTx, uint16_t wordLen, uint16_t parity, uint16_t stopBits);

/**
 * \brief   Config UART loopback function.
 *
 * \param[in] UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] NewState  Enable or disable UART loopback function.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the specified UART loopback function.
 *                      - DISABLE: Disable the specified UART loopback function.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     UART_LoopBackCmd(UART0, ENABLE);
 * }
 * \endcode
 */
void UART_LoopBackCmd(UART_TypeDef *UARTx, FunctionalState NewState);

/**
 * \brief  Check whether the specified UART flag is set.
 *
 * \param[in] UARTx      Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] UART_FLAG  Specify UART flag to check.
 *                       This parameter can be one of the following values, refer to \ref UART_Flag.
 *                       \arg UART_FLAG_RX_DATA_AVA: Rx data is avaliable.
 *                       \arg UART_FLAG_RX_OVERRUN: Rx FIFO overrun.
 *                       \arg UART_FLAG_RX_PARITY_ERR: Rx parity error.
 *                       \arg UART_FLAG_RX_FRAME_ERR: Rx frame error.
 *                       \arg UART_FLAG_RX_BREAK_ERR: Rx break error.
 *                       \arg UART_FLAG_TX_FIFO_EMPTY: Tx Holding Register or Tx FIFO empty
 *                       \arg UART_FLAG_TX_EMPTY: Tx FIFO and Tx shift register are both empty.
 *                       \arg UART_FLAG_RX_FIFO_ERR: Rx FIFO error.
 *                       \arg UART_FLAG_RX_IDLE: Rx idle.
 *                       \arg UART_FLAG_TX_DONE: Tx waveform done & TX_FIFO_EMPTY = 1.
 *                       \arg UART_FLAG_TX_THD: TX_FIFO_LEVEL<=txfifo_trigger_level.
 *
 * \return New status of UART flag.
 *         - SET: The specified UART flag bit is set.
 *         - RESET: The specified flag is not set.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_senddata_continuous(UART_TypeDef *UARTx, const uint8_t *pSend_Buf, uint16_t vCount)
 * {
 *     uint8_t count;
 *
 *     while (vCount / UART_TX_FIFO_SIZE > 0)
 *     {
 *         while (UART_GetFlagStatus(UARTx, UART_FLAG_TX_FIFO_EMPTY) == 0);
 *         for (count = UART_TX_FIFO_SIZE; count > 0; count--)
 *         {
 *             UARTx->UART_RBR_THR = *pSend_Buf++;
 *         }
 *         vCount -= UART_TX_FIFO_SIZE;
 *     }
 *
 *     while (UART_GetFlagStatus(UARTx, UART_FLAG_TX_FIFO_EMPTY) == 0);
 *     while (vCount--)
 *     {
 *         UARTx->UART_RBR_THR = *pSend_Buf++;
 *     }
 * }
 * \endcode
 */
FlagStatus UART_GetFlagStatus(UART_TypeDef *UARTx, uint32_t UART_FLAG);

/**
 * \brief  Get the specified UART line status.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 *
 * \return Line status.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * uint32_t line_status = UART_GetLineStatus(UART_DEMO);
 *
 * if (line_status & UART_FLAG)
 * {
 *     //Add user code here.
 * }
 *
 * \endcode
 */
uint8_t UART_GetLineStatus(UART_TypeDef *UARTx);

/**
 * \brief   Send one byte of data.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] data   Byte data to send.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data = 0x55;
 *     UART_SendByte(UART0, data);
 * }
 * \endcode
 */
void UART_SendByte(UART_TypeDef *UARTx, uint8_t data);

#if UART_SUPPORT_HALF_WORD
/**
 * \brief   Send half word of data.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] data   Byte data to send.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data = 0x55;
 *     UART_SendByte(UART0, data);
 * }
 * \endcode
 */
void UART_SendHalfWord(UART_TypeDef *UARTx, uint16_t data);
#endif

/**
 * \brief   Read a byte of data from UART RX FIFO.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 *
 * \return  Which byte data has been read.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data = UART_ReceiveByte(UART0);
 *
 * }
 * \endcode
 */
uint8_t UART_ReceiveByte(UART_TypeDef *UARTx);

#if UART_SUPPORT_HALF_WORD
/**
 * \brief   Read a byte of data from UART RX FIFO.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 *
 * \return  Which byte data has been read.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data = UART_ReceiveByte(UART0);
 *
 * }
 * \endcode
 */
uint8_t UART_ReceiveHalfWord(UART_TypeDef *UARTx);
#endif

/**
 * \brief   Get the interrupt identifier of the selected UART peripheral.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 *
 * \return The interrupt identifier value.
 *         This return value can be one or a combination of the following:
 *         - UART_INT_ID_LINE_STATUS: Rx line status interrupt ID.
 *         - UART_INT_ID_RX_LEVEL_REACH: Rx data available or trigger level reached interrupt ID.
 *         - UART_INT_ID_RX_TIMEOUT: Rx FIFO data timeout interrupt ID.
 *         - UART_INT_ID_TX_FIFO_EMPTY: Tx FIFO empty interrupt ID.
 *         - UART_INT_ID_MODEM_STATUS: Modem status interrupt ID.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void UART0_Handler()
 * {
 *     uint16_t rx_len = 0;
 *     uint8_t uart_rev_data[32];
 *
 *     //Get interrupt ID.
 *     uint32_t int_status = UART_GetIID(UART0);
 *
 *     //Disable interrupt.
 *     UART_INTConfig(UART0, UART_INT_RD_AVA, DISABLE);
 *
 *     if (UART_GetFlagStatus(UART0, UART_FLAG_RX_IDLE) == SET)
 *     {
 *         UART_INTConfig(UART0, UART_INT_RX_IDLE, DISABLE);
 *         //Add user code here.
 *         UART_ClearRxFIFO(UART0);
 *         UART_INTConfig(UART0, UART_INT_RX_IDLE, ENABLE);
 *     }
 *
 * }
 * \endcode
 */
uint16_t UART_GetIID(UART_TypeDef *UARTx);

#if UART_SUPPORT_CLEAR_TX_FIFO
/**
 * \brief   Clear Tx FIFO of the selected UART peripheral.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     UART_ClearTxFIFO(UART0);
 * }
 * \endcode
 */
void UART_ClearTxFIFO(UART_TypeDef *UARTx);
#endif

/**
 * \brief   Clear Rx FIFO of the selected UART peripheral.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     UART_ClearRxFIFO(UART0);
 * }
 * \endcode
 */
void UART_ClearRxFIFO(UART_TypeDef *UARTx);

/**
 * \brief   Get the data length in Tx FIFO of the selected UART peripheral.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 *
 * \return  Data length in UART TX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data_len = UART_GetTxFIFODataLen(UART0);
 * }
 * \endcode
 */
uint8_t UART_GetTxFIFODataLen(UART_TypeDef *UARTx);

/**
 * \brief   Get the data length in Rx FIFO of the selected UART peripheral.
 *
 * \param[in] UARTx  Select the UART peripheral. Refer to \ref UART_Declaration.
 *
 * \return  Data length in UART RX FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void uart_demo(void)
 * {
 *     uint8_t data_len = UART_GetRxFIFODataLen(UART0);
 * }
 * \endcode
 */
uint8_t UART_GetRxFIFODataLen(UART_TypeDef *UARTx);

/**
 * \brief    Enable/Disable DMA mode on UART side.
 *
 * \param[in] UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] NewState  Enable or disable UART DMA mode.
 *                      This parameter can be one of the following values:
 *                      - true: Enable UART DMA mode.
 *                      - false: Disable UART DMA mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 * void driver_uart_init(void)
 * {
 *     UART_TxDmaCmd(UART_DEMO, false);
 * }
 * \endcode
 */
void UART_TxDmaCmd(UART_TypeDef *UARTx, FunctionalState NewState);

/**
 * \brief    Enable/Disable DMA mode on UART side.
 *
 * \param[in] UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] NewState  Enable or disable UART DMA mode.
 *                      This parameter can be one of the following values:
 *                      - true: Enable UART DMA mode.
 *                      - false: Disable UART DMA mode.
 *
 * <b>Example usage</b>
 * \code{.c}
 * void driver_uart_init(void)
 * {
 *     UART_RxDmaCmd(UART_DEMO, false);
 * }
 * \endcode
 */
void UART_RxDmaCmd(UART_TypeDef *UARTx, FunctionalState NewState);

/**
 * \brief   UART one wire config.
 *
 * \param[in] UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] NewState  UART one wire config is set or not.
 *                      This parameter can be one of the following values:
 *                      - true: UART one wire config is set.
 *                      - false: UART one wire config is unset.
 *
 * <b>Example usage</b>
 * \code{.c}
 * void uart_demo(void)
 * {
 *     UART_OneWireConfig(UART0, true);
 * }
 * \endcode
 */
void UART_OneWireConfig(UART_TypeDef *UARTx, FunctionalState NewState);

/**
 * \brief  UART clock divider config.
 *
 * \param[in] UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[in] ClockDiv  Specify the UART clock divider.
 *                      This parameter can refer to \ref UART_Clock_Divider.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_i2c_init(void)
 * {
 *     RCC_UARTClkDivConfig(UART0, UART_CLOCK_DIVIDER_1);
 * }
 * \endcode
 */
void UART_ClkDivConfig(UART_TypeDef *UARTx, UARTClockDiv_TypeDef ClockDiv);

/**
 * \brief  Get UART clock divider config.
 *
 * \param[in]  UARTx     Select the UART peripheral. Refer to \ref UART_Declaration.
 * \param[out] ClockSrc  Specify the UART clock source.
 * \param[out] ClockDiv  Specify the UART clock divider.
 *                       This parameter can refer to \ref UART_Clock_Divider.
 *
 * \return The status of get clock.
 */
bool UART_ClkGet(UART_TypeDef *UARTx, UARTClockSrc_TypeDef *ClockSrc,
                 UARTClockDiv_TypeDef *ClockDiv);

#if (UART_SUPPORT_RAP_FUNCTION == 1)

void UART_RAPQactiveCtrl(UART_TypeDef *UARTx, uint32_t Qactive, FunctionalState NewState);

#endif

/** End of UART_Exported_Functions
  * \}
  */

/** End of UART
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /* RTL_UART_H */


